"\n\n\n\n\nHome\n\n\nNews\n\n\nSpaceflight\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe Hakuto-R moon lander, which is operated by Tokyo-based company ispace, snapped this photo of Earth about 19 hours after separating from its SpaceX Falcon 9 rocket. The spacecraft launched on Dec. 11, 2022.\n(Image credit: ispace via Twitter)\n\n\n\n\nA private Japanese moon lander has opened its eyes in deep space.The Hakuto-R lander has snapped its first photos since launching atop a SpaceX Falcon 9 rocket on Sunday morning (Dec. 11), representatives of ispace, the Tokyo-based company that operates the spacecraft, announced early Tuesday morning (Dec. 13).\"While initial checkout operations continue in ispace's Mission Control Center (MCC), we have also received the first images taken by our lander-mounted camera! This is an image of the Earth about 19 hours after separation from the launch vehicle,\" ispace said via Twitter (opens in new tab).\"What looks like a crescent moon here is actually the Earth. In the lower right, you can see a plate showing our Hakuto-R corporate partners (as of March 2022),\" the company added in another tweet (opens in new tab).Lunar timeline: Humanity's exploration of the moonWhile initial checkout operations continue in ispace’s Mission Control Center (MCC), we have also received the first images taken by our lander-mounted camera!This is an image of the Earth about 19 hours after separation from the launch vehicle. pic.twitter.com/BcM6mrw1QbDecember 13, 2022See moreIf all goes according to plan, Hakuto-R will arrive at the moon in April, pulling off the first-ever soft lunar touchdown for a Japanese spacecraft. The lander will then deploy a small rover called Rashid for the United Arab Emirates' space agency.But ispace isn't looking that far ahead yet. This is a test flight, the first-ever mission for ispace, and the company is taking things slowly. The mission team is checking off boxes one by one — and Hakuto-R is hitting its marks so far.To date, the team has established communications with the lander and gotten it into a stable orientation with a consistent power supply. Team members also have \"confirmation that there were no deficiencies in the lander's core systems,\" ispace wrote in an update on Monday (opens in new tab) (Dec. 12).Artist's impression of ispace's Hakuto-R lander on the moon. The spacecraft is expected to touch down on Earth's natural satellite in April 2023. (Image credit: ispace)Hakuto-R's journey will lay the foundation for many more missions to come, if all goes according to ispace's plan. The company intends to launch its second mission to the lunar surface in 2024 and its third — a flight for NASA's Commercial Lunar Payload Services program — a year later.After that, ispace is targeting two moon missions a year, company founder and CEO Takeshi Hakamada told Space.com recently.\"Our vision is to establish an economically viable, sustainable ecosystem in cislunar [space],\" Hakamada said.Hakuto-R didn't ride to space alone on Sunday. The Falcon 9 also lofted Lunar Flashlight, a briefcase-sized NASA spacecraft that will hunt for water ice from orbit around the moon.Mike Wall is the author of \"Out There (opens in new tab)\" (Grand Central Publishing, 2018; illustrated by Karl Tate), a book about the search for alien life. Follow him on Twitter @michaeldwall (opens in new tab). Follow us on Twitter @Spacedotcom (opens in new tab) or on Facebook (opens in new tab).  \n\nJoin our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at: community@space.com.\nMichael Wall is a Senior Space Writer with Space.com (opens in new tab) and joined the team in 2010. He primarily covers exoplanets, spaceflight and military space, but has been known to dabble in the space art beat. His book about the search for alien life, \"Out There,\" was published on Nov. 13, 2018. Before becoming a science writer, Michael worked as a herpetologist and wildlife biologist. He has a Ph.D. in evolutionary biology from the University of Sydney, Australia, a bachelor's degree from the University of Arizona, and a graduate certificate in science writing from the University of California, Santa Cruz. To find out what his latest project is, you can follow Michael on Twitter.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"