"\n\t\t\t\t\tNew Brunswick’s acting chief medical officer of health says the province’s respiratory illness season — spurred by a combination of RSV, influenza and COVID-19 — has only worsened since his last update in November.\nDuring a media briefing Tuesday, Dr. Yves Léger told reporters his concern is growing, especially as the holidays approach and people gather.“Across those three respiratory viruses, we’re seeing clear signs of a respiratory illness season that is both earlier than usual and of stronger intensity than usual,” he said.“The situation has not improved since my last update on Nov. 18 and in fact, has worsened in many respects,”The province releases weekly COVID-19 and flu updates, which are reported with a seven-day and 10-day lag, respectively.\t\t\t\t\t\t\t\t\tStory continues below advertisement\n\t\t\t\n\t\t\t\n\t\t\t\n\n\t\t\t\t\t\n\t\t\tAccording to Léger, the latest flu update has 836 positive results for influenza, which is the highest number seen in New Brunswick since the start of the influenza report in 2005.The province is also reporting 115 hospitalizations with influenza, which is nearly twice the high of 69 recorded in January 2019. Léger said while most of the hospitalizations are among patients aged 65 and older, about 17 per cent were in young people aged 19 and under.Léger said it’s possible more robust testing can account for the increase in cases identified.He urged more New Brunswickers to get the flu shot, which hasn’t had a strong uptake.According to the province, 196,976 influenza vaccines had been administered as of Dec. 12 — down from 219,475 over the same period last year.\t\n\t\t\tTrending Now\n\t\n\t\n\tTrending Now\n\t\n\t\n\t\n\tMeanwhile, he said RSV, or respiratory syncytial virus, has shown signs of stabilizing. RSV is most common in children and has inundated pediatric hospitals across the country, including in New Brunswick. Léger warned that stability does not mean lowered risk.“It continues to circulate widely within the province,” he said.\t\t\t\t\t\t\t\t\tStory continues below advertisement\n\t\t\t\n\t\t\t\n\t\t\t\n\n\t\t\t\t\t\n\t\t\tCOVID-19 activity, he added, has also been increasing.The latest COVID-19 report showed that between Dec. 4 and 10, there were 819 PCR-confirmed cases, 40 current hospitalizations, and seven deathsLéger stressed the reminders health officials have often repeated lately: keep up to date with vaccines, avoid people if sick, and to be mindful of gatherings during the holidays. He said people should think about whether their contacts are considered vulnerable.“The more we can limit the size of our gatherings, the better,” he said.But Léger stopped short of supporting mandates — for now. He said it’s something health officials are monitoring, but not a decision “taken lightly” because they “remove people’s liberties to make decisions on their own.”“We don’t feel that we’re there at this point,” he said.“At this time we are not considering any mandates of any kind and certainly if that were to change, we would definitely communicate that to New Brunswickers at that time.”Meanwhile, hospitals in the province continue to report high occupancy rates and capacity issues at emergency departments.Greg Doiron, vice-president clinical operations with Horizon Health, told reporters during the update that their hospitals have seen occupancy rates above 95 per cent, including pediatrics.\t\t\t\t\t\t\t\t\tStory continues below advertisement\n\t\t\t\n\t\t\t\n\t\t\t\n\n\t\t\t\t\t\n\t\t\t“We’re dealing with the earliest and most aggressive start of the flu season we’ve ever seen,” he said.He urged people to treat their health-care workers “with kindness” and praised staff for their work during these times.\n\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t4:08\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tViral trifecta: Trio of illnesses infecting children, straining hospitals\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\n\t\t© 2022 Global News, a division of Corus Entertainment Inc.\t\n"