"\nThe December update will arrive for Lost Ark, and here’s the full list of changes and fixes that will be added with this patch. The MMO action role-playing game was co-developed by Tripod Studio and Smilegate. It’s one of the most popular titles in the gaming world and the developer supports the game with periodical patches. For instance, a new version will be kicking out tomorrow which points out Wreck the Halls. Let’s deep dive into the Lost Ark December update for Wreck the Halls patch notes.\nLost Ark December Update for ”Wreck the Halls” Patch Notes\n\n\n\n\nLost Ark December Update for Wreck the Halls Patch Notes\nThe December “Wreck the Halls” Update arrives in Arkesia tomorrow. Downtime for the update will begin on December 14 at 12 AM PDT (8 AM UTC) and is expected to last 4 hours. The road to Brelshaza concludes tomorrow when the cunning and ruthless Phantom Legion Commander arrives. Brelshaza isn’t the only powerful force arriving in Arkesia— Caliligos, the master of lighting, is available to challenge in a new Guardian Raid, and the Summoner Advanced Class adds a new powerful tool for any player looking to bolster their roster. The new content doesn’t stop with the new raids and a new Advanced Class. New Tier 3 Progression Materials, higher level South Vern ‘Void’ Chaos Dungeons, and Hard T3 Cube & Boss Rush activities (Item Level 1490) arrive along with a new Neria’s Wardrobe, a festive Holiday Event, and a new accessory type; the Bracelet. Find the full list of new content, events, cosmetics, and other updates below!\nSpotlight – Lost Ark December Update for Wreck the Halls Patch Notes\nBrelshaza Legion Raid\nFace Brelshaza, Commander of the Phantom Legion in an immersive and challenging 8-player Legion Raid spanning 6 unique gates and encounters. The most cunning and ruthless of all the Legion Commanders, she’s known to charm her enemies and inflict them with awful hallucinations. With so many encounters, the Item Level requirements rise every two gates. Here’s where your gear will need to be to challenge Phantom Legion Commander Brelshaza:\n\nPhantom Astalgia: Déjà Vu – Item Level 1430\nGates 1 & 2 – Item Level 1490\nGates 3 & 4 – Item Level 1500\nGates 5 & 6 – Item Level 1520\n\nSimilar to the “Midnight Circus: Encore” difficulty of the Kakul-Saydon Legion Raid, an easier difficulty is available for players to practice the difficult encounters and mechanics; Phantom Astalgia: Déjà Vu. A special training ground for the Brelshaza Legion Raid will also be opened in Trixion. Phantom Marks will be introduced along with the Legion Raid, along with a new page becoming available at the Legion Raid Exchange NPC where Phantom Marks can be exchanged for rewards.\nSummoner Advanced Class\nDespite their delicate constitution, Summoners are a force to be reckoned with in any battle. They call forth elemental spirits to fight for them, each with their own special skills to help the Summoner shine in every situation. With a powerful variety of water, lightning, earth, and more unique attacks, the Summoner is a welcome addition to the roster of available Mage Advanced Classes. The Summoner will join the Bard, Sorceress, and Arcanist as the fourth Mage Advanced Class. Learn more about the Summoner’s Class Identity, Skills, and Engravings in the Summoner Lost Ark Academy.\nCaliligos Guardian Raid – Lost Ark December Update for ”Wreck the Halls” Patch Notes\nCaliligos is the master of lightning, commanding blue lightning to bring his enemies to their knees. His wings are as swift as the wind, and the power of blue thunderbolts concentrate in his horn, sharper than any spears, to pierce the hearts of his enemies. As a ruler of the skies, he was worshipped in the past as a god. But Caliligos is no god— he’s a cruel ruler of the sky and a ruthless guardian. Caliligos will join the gauntlet of Level 6 Guardians. The Item Level requirement to challenge Caliligos is 1490.\nTier 3 Activity and Progression Updates\n\nNew T3 Gear & progression materials have been added. A new Relic gear set can be crafted from materials earned in the Brelshaza Legion Raid. Requirements for crafting the new set: Item Level 1490 and complete the “Kill the Legion Commanders and leave the gear behind” achievement, which requires: Regardless of the set, equip 6 pieces of Demon Beast and Covetous Legion Commander Relic gear at the same time.\n\nThe new Relic gear can be honed up to Lv. 20, raising the maximum Item Level from 1575 to 1590. The honing success rate will be different from existing Legion Raid gear.\nThe new Relic gear has the same set effect as the existing Legion Raid Relic gear.\nIf you gear transfer an existing Legion Raid Relic gear piece into the new Relic gear, the gear quality will also be transferred. If the gear to transfer into has a higher quality, the quality will stay the same. Artisan’s Energy, honing XP, and increase in success rate after fail are not transferred. After the transfer is complete, the gear that you used will have a honing level of 0.\nAdded new progression materials that can be used to hone the new Relic gear set:\n\nObliteration Stone\nProtection Stone\nMarvelous Honor Leapstone\nSuperior Oreha Fusion Material\n\n\nThe new progression materials can be earned from the new Void Chaos Dungeons, Caliligos Guardian Raid, Challenge Guardian Raid, Challenge Abyssal Dungeon, Stronghold Crafting and Research, the Brelshaza Legion Raid, and Una’s Quests.\n\n\nT3 Hall of the Sun (Hard) Boss Rush and T3 Dimension Cube (Hard) both arrive in the Wreck the Hall Update. Both requiring Item Level 1490 for entry, these new difficulties will challenge heroes with a gauntlet of new enemies— but with bigger challenge comes bigger rewards.\nAdded two new South Vern Void Chaos Dungeons. With new progression materials, Bracelets, along with the standard Chaos Dungeon rewards, there’s plenty of rewards for clearing the new Void levels. Item Level requirements:\n\nVoid 1 – Item Level 1490\nVoid 2 – Item Level 1520\n\n\n\nGeneral – Lost Ark December Update for Wreck the Halls Patch Notes\nNEW BRACELET ACCESSORY\nThe new Bracelet accessory increases character stats, and has perks, but doesn’t have Engravings slotted into it like other accessories. Bracelets have fixed bonuses and granted bonuses. Fixed bonuses are granted at random when you obtain a bracelet and cannot be changed. Granted bonuses can be added or changed through Bracelet Specialist NPC, who can be found in major cities across Arkesia! Bracelets can be earned from the Brelshaza Legion Raid, Caliligos Guardian Raid, and South Vern’s new Void Chaos dungeon.\nBOT PREVENTION UPDATES\nWe know that bots have been causing frustration within the community, and we share in that frustration. As we wage the war on bots infiltrating Arkesia, we’re continuing to try new methods. In this update, we’ve worked together with Smilegate RPG on new prevention measures.\nTo prevent bots from negatively impacting the player-driven economy, we’ve updated the list of economic and social systems restricted from accounts that haven’t achieved a trusted status in Lost Ark. Previously, untrusted accounts were prevented from accessing economic and social features such as initiating player-to-player trades and sending player mail. With the prevention updates, untrusted accounts will now be restricted from the Auction House, Market, Loot Auctions, Stronghold Gifting, and all player-to-player trading. We’ve banned millions of bot accounts over the past few months, and have additional ban waves planned to purge existing bot accounts.\nThe path to earn trusted status won’t change, and these updates will only affect newly created accounts after the update. Existing Lost Ark players will not be impacted. New adventurers arriving in Arkesia can earn their trusted status in multiple ways and can choose the path that’s right for them. The first option is for new players to enable the Steam Guard mobile authenticator, and have a Steam profile that’s no longer a ‘Limited User’ account. This is an easy path that won’t require making any Lost Ark purchases. Alternatively, new players can also receive trusted status by making any purchase in Lost Ark through either Steam or Amazon.\nTwo other updates are also included in this update to prevent bots from negatively impacting the player-driven economy:\n\nConverted some quest rewards from Gold to Silver.\nAdded a daily 20-item registration limit per Roster for the Auction House and Market.\n\nAs we continue our quest to rid Arkesia of bots, we understand it may affect new players who install after the update. We’re keeping a close eye out for feedback, so please continue to share your experiences with us on the forums. We appreciate your patience as we continue working to bring the best possible Lost Ark experience to our players.\nFESTIVITY ISLAND\nCelebrate the holidays on Festivity Island in a new event! Use the Ocean Liner for express travel to the new island, and help Turry the Polar Bear with a variety of quests. Earn Joytide Stars and Joytide Twilight Stars by completing event quests, that you can trade for special items and valuable rewards during the event, and Snowflake Powder that can be used to bake a special Stronghold feast. During the event period, bake a Winter Festival Cake in your Stronghold and share the feast! Visit Chef Hyde of the Stronghold and click on the “Order Cooking Meal” tab to request “Feast: Winter Festival Cake” from the feast menu.\nGeneral Updates\n\nAdded the Phantom Ghost Ship requiring Item Level 1490 off the northwest coast of South Vern.\nAdded a new track of daily log-in rewards.\nAdded Kakul-Saydon to the list of Legion Raids eligible for Procyon’s Protection.\nUpdated Tier 3 activities to support the new Tier 3 progression materials, including Challenge Guardian Raid rewards, Challenge Abyssal Dungeon rewards, Stronghold Crafting, and Research, and Una’s Quest rewards for players that have reached Item Level 1490.\n\nStore Updates\nGet cozy and warm with a new winter-themed Neria’s Wardrobe, or more formal with the Festival and Ball skins. Celebrate the Summoner’s release with an exclusive Summoner Skin, the Summoner Dawn skins, and special packages found in the in-game store.\nNotable Bug Fixes – Lost Ark December Update for Wreck the Halls Patch Notes\n\nFixed an issue causing some skins to now be shown in the Skin Storage menu when sorting by set.\nFixed an issue with the Reaper’s Identity Gauge tooltip.\nFixed an issue causing the voice-over audio to be missing during the “Proud Memories of Adventure” Stronghold quest.\nFixed a missing quest after finishing “Before Going on an Adventure”.\nFixed an issue that prevented players from accessing the 9th stage of Ancient Elveria after destroying certain props.\nFixed an issue causing missing VO for a female character in the “Crown of Lakebar” quest.\nFixed an issue that prevents a crocodile on Volare Island from taking damage.\nFixed an issue that prevented the Starving Ghoul in Ancient Elveria from attacking players.\nFixed an issue that caused PvP bot names to be mentioned twice in the lobby for custom Proving Grounds matches.\nFixed an issue occasionally preventing players from loading into an instance when the entrance confirmation was accepted immediately after it was displayed.\nFixed an issue causing “LS” to not function in some scenarios while using a controller.\n\nLost Ark is available on PC. For more information regarding this patch, please visit the official Lost Ark site.\n\n"